EDT/src/Tasks/ЗадачиПользователя/ЗадачиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиПользователя</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСрока</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусВыполнение</types>
    </type>
  </attributes>
</mdclass:Task>

EDT/src/Enums/СтатусВыполнение/СтатусВыполнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусВыполнение</name>
  <enumValues>
    <name>НужноСделать</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
</mdclass:Enum>

EDT/src/Tasks/ЗадачиПользователя/Forms/ФормаСписка/Module.bsl
&НаСервереБезКонтекста
Процедура ОбновитьСтатусЗадач(МассивЗадач, НовыйСтатус)

	Для каждого ТекЗадача Из МассивЗадач Цикл
	
		ЗадачаОбъект = ТекЗадача.ПолучитьОбъект();
		Если ЗадачаОбъект.Статус = НовыйСтатус Тогда
			Продолжить;
		КонецЕсли;
		
		ЗадачаОбъект.Статус = НовыйСтатус;
		
		Если НовыйСтатус = Перечисления.СтатусВыполнение.Завершено Тогда
			ЗадачаОбъект.Выполнена = Истина;
		КонецЕсли;                                                
		
		Попытка
			ЗадачаОбъект.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось изменить статус задачи " + ТекЗадача + " по причине: " + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры // ()

&НаКлиенте
Процедура ОбновитьСтатусКлиента(МассивЗадач, НовыйСтатус)

	Если ТипЗнч(МассивЗадач) = Тип("Массив") Тогда
		ОбновитьСтатусЗадач(МассивЗадач, НовыйСтатус);
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиПользователя")); 
КонецПроцедуры // ()


&НаКлиенте
Процедура СписокНужноВыполнитьПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)  
	ОбновитьСтатусКлиента(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусВыполнение.НужноСделать")); 
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусКлиента(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусВыполнение.ВРаботе")); 
КонецПроцедуры

&НаКлиенте
Процедура СписокТестированиеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусКлиента(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусВыполнение.Тестирование"));
КонецПроцедуры

&НаКлиенте
Процедура СписокГотовоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле) 
	ОбновитьСтатусКлиента(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусВыполнение.Завершено"));
КонецПроцедуры
